<?php
// 脚本生成时间：2026-01-17 12:00:19
header('Content-Type: text/plain; charset=utf-8');
错误报告(0);
函数 creat_m3u8($id,$qlt,$alt){
    $timestamp = intval(time()/4-355017628);
    $t=$timestamp*4;
    $m3u8 = "#EXTM3U\n";
    $m3u8.= "#EXT-X-VERSION:3\n";
    $m3u8.= "#EXT-X-TARGETDURATION:4\n";
    $m3u8.= "#EXT-X-MEDIA-SEQUENCE:{$timestamp}\n";
    for ($i=0; $i<10; $i++) {
        $m3u8.= "#EXTINF:4,";
        $m3u8.="https://ntd-tgc.cdn.hinet.net/live/pool/{$id}/litv-pc/{$id}-avc1_6000000={ $qlt}-mp4a_134000_zho={$alt}-begin={$t}0000000-dur=40000000-seq={$timestamp}.ts\n";
        $timestamp = $timestamp+1;
        $t=$t+4;
    }
    返回 $m3u8；
}
function get_path() {
    $protocol = (isset($_SERVER['HTTPS']) && $_SERVER['HTTPS'] !== 'off') ? "https" : "http";
    返回 $protocol . "://" . $_SERVER['HTTP_HOST'] . $_SERVER['SCRIPT_NAME'];
}
函数 creat_m3u($n){
    $m3u="#EXTM3U x-tvg-url=".'"https://epg.iill.top/epg.xml.gz"'."\n";
    $local_path = get_path();
    foreach ($n as $id => $key ){
        $m3u.='#EXTINF:-1 tvg-id="'.$id.'" tvg-name="'.$key[4].'" tvg-logo="https://epg.iill.top/logo/'.$key[2].'.png" group-title="'.$key[3].'",'.$key[4].."\n{$local_path}?id={$id}\n";
    }
    返回 $m3u；
}
$n = [
//以下参数为脚本每4小时自动生成一次
"4gtv-4gtv002"=>[1,11,"民视","综合频道","民视"],
"4gtv-4gtv003"=>[1,7,"民视第一台","综合频道","民视第一台"],
"litv-ftv13"=>[1,7,"民视新闻台","新闻财经","民视新闻台"],
"4gtv-4gtv001"=>[1,7,"民视台湾台","综合频道","民视台湾台"],
"litv-ftv09"=>[1,6,"民视影剧台","电影戏剧","民视影剧台"],
"litv-ftv07"=>[1,6,"民视旅游台","科教纪实","民视旅游台"],
"4gtv-4gtv004"=>[1,9,"民视综艺台","综艺娱乐","民视综艺台"],
"4gtv-4gtv040"=>[1,7,"中视","综合频道","中视"],
"4gtv-4gtv074"=>[1,6,"中视新闻","新闻财经","中视新闻台"],
"4gtv-4gtv009"=>[2,9,"中天新闻","新闻财经","中天新闻台"],
"4gtv-4gtv041"=>[1,7,"华视","综合频道","华视"],
"4gtv-4gtv052"=>[1,6,"华视新闻","新闻财经","华视新闻"],
"4gtv-4gtv046"=>[1,7,"靖天综合台","靖天综合台","靖天综合台"],
"4gtv-4gtv063"=>[1,8,"靖天国际台","综合频道","靖天国际台"],
"4gtv-4gtv058"=>[1,9,"靖天戏剧台","电影戏剧","靖天戏剧台"],
"4gtv-4gtv047"=>[1,2,"靖天日本台","综合频道","靖天日本台"],
"4gtv-4gtv055"=>[1,9,"靖天映画台","电影戏剧","靖天映画台"],
"4gtv-4gtv044"=>[1,7,"靖天卡通台","卡通","靖天卡通台"],
"4gtv-4gtv062"=>[1,9,"靖天育乐台","综艺娱乐","靖天育乐台"],
"4gtv-4gtv065"=>[1,9,"靖天资讯台","新闻财经","靖天资讯台"],
"4gtv-4gtv061"=>[1,7,"靖天电影台","电影戏剧","靖天电影台"],
"4gtv-4gtv054"=>[1,9,"靖天欢乐台","综艺娱乐","靖天欢乐台"],
"litv-xinchuang12"=>[10003,20000,"龙华偶像台","电影","龙华偶像台"],
"litv-xinchuang01"=>[10002,20000,"龙华卡通台","卡通动漫","龙华卡通台"],
"litv-xinchuang18"=>[10003,20000,"龙华戏剧台","戏剧电影","龙华戏剧台"],
"litv-xinchuang21"=>[10003,20000,"龙华经典台","戏剧","龙华经典台"],
"litv-xinchuang03"=>[10003,20000,"龙华电影台","戏剧","龙华电影台"],
"litv-xinchuang02"=>[10003,20001,"龙华洋片台","戏剧电影","龙华洋片台"],
"4gtv-4gtv045"=>[1,7,"靖洋戏剧台","靖洋戏剧台","靖洋戏剧台"],
"4gtv-4gtv057"=>[1,7,"靖洋卡通-Nice-Bingo","卡通动漫","靖洋卡通NiceBingo"],
"litv-longturn14"=>[1,6,"寰宇新闻台","新闻财经","寰宇新闻台"],
"4gtv-4gtv156"=>[1,8,"寰宇新闻台湾台","新闻财经","寰宇新闻台湾台"],
"4gtv-4gtv158"=>[1,2,"寰宇财经台","新闻财经","寰宇财经台"],
"4gtv-4gtv067"=>[1,9,"TVBS精采","综艺娱乐","TVBS精采台"],
"4gtv-4gtv034"=>[1,7,"八大精彩台","综艺娱乐","八大精彩台"],
"4gtv-4gtv039"=>[1,6,"八大综艺台","综艺娱乐","八大综艺台"],
"4gtv-4gtv070"=>[1,9,"ELTA娱乐","综艺娱乐","ELTA娱乐台"],
"litv-xinchuang20"=>[10003,20000,"ELTA生活英语","科教纪实","ELTV生活英语"],
"4gtv-4gtv152"=>[1,7,"东森新闻","新闻财经","东森新闻"],
"4gtv-4gtv153"=>[1,6,"东森财经","新闻财经","东森财经新闻"],
"4gtv-4gtv075"=>[1,6,"镜电视新闻台","新闻财经","镜电视新闻台"],
"4gtv-4gtv076"=>[1,7,"亚洲旅游台","科教纪实","亚洲旅游台"],
"4gtv-4gtv053"=>[1,9,"GINX-Esports-TV","体育竞技","GINXEsportsTV"],
"4gtv-4gtv014"=>[1,6,"时尚运动X","体育竞技","时尚运动X"],
"4gtv-4gtv101"=>[1,6,"智林体育","体育竞技","智林体育台"],
"4gtv-4gtv077"=>[1,5,"TraceSports","体育竞技","TraceSports"],
"4gtv-4gtv011"=>[1,7,"影迷数位电影台","电影戏剧","影迷数位电影台"],
"4gtv-4gtv017"=>[1,7,"AMC-最爱电影","电影戏剧","AMC电影台"],
"4gtv-4gtv042"=>[1,7,"公视戏剧台","电影戏剧","公视戏剧台"],
"4gtv-4gtv049"=>[1,9,"采昌影剧台","电影戏剧","采昌影剧台"],
"litv-xinchuang22"=>[10003,20001,"台湾戏剧台","电影戏剧","台湾戏剧台"],
"litv-ftv15"=>[1,7,"影迷数位纪实台","科教纪实","影迷数位纪实台"],
"4gtv-4gtv018"=>[1,7,"达文西频道","科教纪实","达文西频道"],
"4gtv-4gtv059"=>[1,7,"古典-古典乐","科教纪实","古典古典乐"],
"4gtv-4gtv083"=>[1,6,"Mezzo-Live","科教纪实","MezzoLive"],
"4gtv-4gtv006"=>[1,10,"猪哥亮歌厅秀","综艺娱乐","猪哥亮歌厅秀"],
"4gtv-4gtv082"=>[1,7,"Trace-Urban","体育竞技","TraceUrban"],
"4gtv-4gtv016"=>[1,7,"韩国娱乐台KMTV","综艺娱乐","韩国娱乐台"],
"4gtv-4gtv079"=>[1,8,"Arirang-TV","新闻财经","ArirangTV"],
"litv-ftv10"=>[1,7,"MCE","电影戏剧","MCE 我的欧洲电影"],
"4gtv-4gtv104"=>[1,7,"第1商业台","新闻财经","第1商业台"],
"4gtv-4gtv110"=>[1,6,"宠物俱乐部TV","科教纪实","宠物俱乐部TV"],
"litv-xinchuang19"=>[10003,20000,"Smart-知识台","科教纪实","Smart知识台"],
"4gtv-4gtv013"=>[1,7,"视纳华仁纪实频道","科教纪实","视纳华仁纪实频道"],
"4gtv-4gtv043"=>[1,7,"客家电视台","综合频道","客家电视台"],
"litv-ftv16"=>[1,6,"好消息","好消息","综合频道","好消息"],
"litv-ftv17"=>[1,6,"好消息2台","综合频道","好消息2台"],
"4gtv-4gtv084"=>[1,7,"国会频道1","科教纪实","国会频道1"],
"4gtv-4gtv085"=>[1,6,"国会频道2","科教纪实","国会频道2"],

//如遇到音视频波动，需手动修改以下数字部分
"4gtv-4gtv155"=>[1,7,"民视","综合频道","民视"],
"4gtv-4gtv080"=>[1,8,"中视经典","综艺娱乐","中视经典台"],
"4gtv-4gtv064"=>[1,9,"中视菁采台","综艺娱乐","中视菁采台"],
"4gtv-4gtv109"=>[1,9,"中天亚洲","综合频道","中天亚洲台"],
"litv-xinchuang11"=>[10003,20000,"龙华日韩台","戏剧","龙华日韩台"],
"4gtv-4gtv073"=>[1,6,"TVBS","综合频道","TVBS"],
"4gtv-4gtv072"=>[1,6,"TVBS新闻","新闻财经","TVBS新闻台"],
"4gtv-4gtv068"=>[1,8,"TVBS欢乐台","综艺娱乐","TVBS欢乐台"],
"4gtv-4gtv066"=>[1,6,"台视","综合频道","台视"],
"4gtv-4gtv051"=>[1,6,"台视新闻台","新闻财经","台视新闻台"],
"4gtv-4gtv056"=>[1,6,"台视财经台","新闻财经","台视财经台"],
"litv-xinchuang07"=>[10003,20000,"博斯运动1","体育竞技","博斯运动一台"],
"litv-xinchuang08"=>[10003,20000,"博斯运动1","体育竞技","博斯运动二台"],
"litv-xinchuang10"=>[10003,20000,"博斯无限","体育竞技","博斯无限台"],
"litv-xinchuang13"=>[10003,20000,"博斯无限2","体育竞技","博斯无限二台"],
"litv-xinchuang09"=>[10003,20000,"博斯网球台","体育竞技","博斯网球台"],
"litv-xinchuang05"=>[10003,20000,"博斯高球1","体育竞技","博斯高球台"],
"litv-xinchuang06"=>[10003,20000,"博斯高球2","体育竞技","博斯高球二台"],
"litv-xinchuang04"=>[10003,20000,"博斯娱乐","体育竞技","博斯娱乐台"],
"4gtv-4gtv010"=>[1,7,"非凡新闻台","新闻财经","非凡新闻台"],
"4gtv-4gtv048"=>[1,7,"非凡商业台","新闻财经","非凡商业台"],
"litv-ftv03"=>[1,7,"VOA-美国之音","新闻财经","VOA美国之音"],
];
$id = $_GET['id'] ?? '';
if(empty(trim($id))){
    die(creat_m3u($n));
}
if(!isset($n[$id])){
    header("HTTP/1.1 404 Not Found");
    die('未找到通道');
}
$m3u8 = creat_m3u8($id, $n[$id][0], $n[$id][1]);
header('Content-Type: application/vnd.apple.mpegurl');
header('Content-Disposition: inline; filename=index.m3u8');
die(trim($m3u8));